src/cf/DataProcessors/ОбработкаОбменов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ОбработкаОбменов</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/cf/InformationRegisters/ОчередьСообщенийКПолучениюТС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ОчередьСообщенийКПолучениюТС</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сообщение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Обработано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ОчередьСообщенийКОтправкеТС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ОчередьСообщенийКОтправкеТС</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сообщение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Отправлено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ОчередьСообщенийКОтправкеWMS.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ОчередьСообщенийКОтправкеWMS</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сообщение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Отправлено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ОчередьСообщенийКПолучениюWMS.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ОчередьСообщенийКПолучениюWMS</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сообщение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Обработано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/DataProcessors/ОбработкаОбменов/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Перем Клиент, АдресВоВременномХранилище;

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	//пример для бесплатного https://www.cloudamqp.com/
	
	//Адрес = "flamingo-01.rmq.cloudamqp.com";
	//Порт = 5672;
	//Логин = "dcyuszes";
	//Пароль = "n1ka_691bexu6e27hhqrKUgwBuvJkxx";
	//ВиртуальныйХост = "dcyuszes";
	
	ТочкаОбмена = "data_test";
	ИмяОчереди = "rout_test";
	ТекстСообщения = "Test1";
	
КонецПроцедуры

#Область ПодключениеИнициализацияКомпоненты

&НаКлиенте
Процедура ПодключитьКомпонентуКлиент(КомпонентаПодключена = Неопределено)
	
	АдресВоВременномХранилище = ПолучитьАдресМакетаКомпановкиНаСервере(ЭтаФорма.УникальныйИдентификатор);
	
	УстановитьВнешнююКомпоненту(АдресВоВременномХранилище);
	КомпонентаПодключена = ПодключитьВнешнююКомпоненту(
	АдресВоВременномХранилище,
	"BITERP",
	ТипВнешнейКомпоненты.Native);
	Сообщить(НСтр("ru = 'Компонента подключена!'"));
КонецПроцедуры

&НаСервере
Процедура ПодключитьКомпонентуСервер(КомпонентаПодключена = Неопределено)
	
	АдресВоВременномХранилище = ПолучитьАдресМакетаКомпановкиНаСервере(ЭтаФорма.УникальныйИдентификатор);
	КомпонентаПодключена = ПодключитьВнешнююКомпоненту(
	АдресВоВременномХранилище,
	"BITERP",
	ТипВнешнейКомпоненты.Native);
	Сообщить(НСтр("ru = 'Компонента подключена!'"));
КонецПроцедуры

&НаКлиенте
Функция ПолучитьКомпонентуКлиент()
	
	Если Клиент = Неопределено Тогда
		Если Не ИнициализироватьКомпонентуКлиентСервер(Клиент) Тогда
			
			ПодключитьКомпонентуКлиент();
			ИнициализироватьКомпонентуКлиентСервер(Клиент);
			
		КонецЕсли;
	КонецЕсли;
	
	Возврат Клиент;
КонецФункции

&НаСервере
Функция ПолучитьКомпонентуСервер()
	
	КлиентКомпоненты = Неопределено;
	Если Не ИнициализироватьКомпонентуКлиентСервер(КлиентКомпоненты) Тогда
		
		ПодключитьКомпонентуСервер();
		ИнициализироватьКомпонентуКлиентСервер(КлиентКомпоненты);
		
	КонецЕсли;
	
	Возврат КлиентКомпоненты;
КонецФункции

#КонецОбласти

&НаКлиенте
Процедура СозданиеТочкиИОчереди(Команда)
	
	Если ИспользоватьКомпоненту = 0 Тогда
		СозданиеТочкиИОчередиКлиент();
	ИначеЕсли ИспользоватьКомпоненту = 1 Тогда
		СозданиеТочкиИОчередиСервер();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СозданиеТочкиИОчередиКлиент()
	
	КлиентКомпоненты = ПолучитьКомпонентуКлиент();
	СозданиеТочкиИОчередиКлиентСервер(КлиентКомпоненты, Этаформа);
	
КонецПроцедуры

&НаСервере
Процедура СозданиеТочкиИОчередиСервер()
	
	КлиентКомпоненты = ПолучитьКомпонентуСервер();
	СозданиеТочкиИОчередиКлиентСервер(КлиентКомпоненты, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьСообщение(Команда)
	
	Если ИспользоватьКомпоненту = 0 Тогда
		ОтправитьСообщениеКлиент();
	ИначеЕсли ИспользоватьКомпоненту = 1 Тогда
		ОтправитьСообщениеСервер();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправитьСообщениеКлиент()
	
	КлиентКомпоненты = ПолучитьКомпонентуКлиент();
	ОтправитьСообщениеКлиентСервер(КлиентКомпоненты, ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ОтправитьСообщениеСервер()
	
	КлиентКомпоненты = ПолучитьКомпонентуСервер();
	ОтправитьСообщениеКлиентСервер(КлиентКомпоненты, ЭтаФорма);
	
КонецПроцедуры 






&НаКлиенте
Процедура ПрочитатьСообщение(Команда)
	
	Если ИспользоватьКомпоненту = 0 Тогда
		ПрочитатьСообщениеКлиент();
	ИначеЕсли ИспользоватьКомпоненту = 1 Тогда
		ПрочитатьСообщениеСервер();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПрочитатьСообщениеКлиент()
	
	КлиентКомпоненты = ПолучитьКомпонентуКлиент();
	ПрочитатьСообщениеКлиентСервер(КлиентКомпоненты, ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьСообщениеСервер()
	
	КлиентКомпоненты = ПолучитьКомпонентуСервер();
	ПрочитатьСообщениеКлиентСервер(КлиентКомпоненты, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьПодключение(Команда)
	
	Если ИспользоватьКомпоненту = 0 Тогда
		ПроверитьПодключениеКлиент();
	ИначеЕсли ИспользоватьКомпоненту = 1 Тогда
		ПроверитьПодключениеСервер();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьПодключениеКлиент()
	
	КлиентКомпоненты = ПолучитьКомпонентуКлиент();
	ПроверитьПодключениеКлиентСервер(КлиентКомпоненты, ЭтаФорма);
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьПодключениеСервер()
	
	КлиентКомпоненты = ПолучитьКомпонентуСервер();
	ПроверитьПодключениеКлиентСервер(КлиентКомпоненты, ЭтаФорма);
	
КонецПроцедуры

#Область СлужебныеПроцедуры

&НаСервере
Функция ПолучитьАдресМакетаКомпановкиНаСервере(УникальныйИдентификатор)
	
	МакетВнешнейКомпоненты    = РеквизитФормыВЗначение("Объект").ПолучитьМакет("ВнешняяКомпонента");
	АдресВоВременномХранилище = ПоместитьВоВременноеХранилище(МакетВнешнейКомпоненты, УникальныйИдентификатор);
	
	Возврат АдресВоВременномХранилище;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ИнициализироватьКомпонентуКлиентСервер(Компонента)
	
	Попытка
		Компонента  = Новый("AddIn.BITERP.PinkRabbitMQ");
		Возврат Истина;
	Исключение
		Возврат Ложь;
	КонецПопытки;
	
КонецФункции

#КонецОбласти

#Область ПроцедурыРаботаСRabbitMQ

&НаКлиентеНаСервереБезКонтекста
Процедура ПроверитьПодключениеКлиентСервер(КлиентКомпоненты, Форма)
	
	Попытка
		КлиентКомпоненты.Connect(
		Форма.Адрес,
		Число(Форма.Порт),
		Форма.Логин,
		Форма.Пароль,
		Форма.ВиртуальныйХост);
	Исключение
		СистемнаяОшибка = ОписаниеОшибки();
		ТекстСообщения = "Ошибка подключения!%СистемнаяОшибка%";
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%СистемнаяОшибка%", СистемнаяОшибка);
		ВызватьИсключение ТекстСообщения;
	КонецПопытки;
	
	Сообщить(НСтр("ru = 'Подключение успешно выполнено!'"));
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура СозданиеТочкиИОчередиКлиентСервер(КлиентКомпоненты, Форма)
	
	Попытка
		КлиентКомпоненты.Connect(
		Форма.Адрес,
		Форма.Порт,
		Форма.Логин,
		Форма.Пароль,
		Форма.ВиртуальныйХост);
		
		ТочкаОбмена = Форма.ТочкаОбмена;
		ИмяОчереди  = Форма.ИмяОчереди;
		
		КлиентКомпоненты.DeclareExchange(ТочкаОбмена, "topic", Ложь, Истина, Ложь);
		КлиентКомпоненты.DeclareQueue(ИмяОчереди, Ложь, Ложь, Ложь, Ложь);
		КлиентКомпоненты.BindQueue(ИмяОчереди, ТочкаОбмена, "#" + ИмяОчереди + "#");
	Исключение
		СистемнаяОшибка = ОписаниеОшибки();
		ТекстСообщения = "Ошибка создания точек и очередей!%СистемнаяОшибка%";
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%СистемнаяОшибка%", СистемнаяОшибка);
		ВызватьИсключение ТекстСообщения;
	КонецПопытки;
	
	Сообщить("Точки и очереди успешно созданы!");
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОтправитьСообщениеКлиентСервер(КлиентКомпоненты, Форма)
	
	Попытка
		КлиентКомпоненты.Connect(
		Форма.Адрес,
		Форма.Порт,
		Форма.Логин,
		Форма.Пароль,
		Форма.ВиртуальныйХост);
		
		ТочкаОбмена    = Форма.ТочкаОбмена;
		ИмяОчереди     = Форма.ИмяОчереди;
		ТекстСообщения = Форма.ТекстСообщения;
		
		КлиентКомпоненты.BasicPublish(
		ТочкаОбмена,
		"#" + ИмяОчереди + "#",
		ТекстСообщения,
		1,
		Ложь);
	Исключение
		СистемнаяОшибка = ОписаниеОшибки();
		ТекстСообщения = "Ошибка отправки сообщения!%СистемнаяОшибка%";
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%СистемнаяОшибка%", СистемнаяОшибка);
		ВызватьИсключение ТекстСообщения;
	КонецПопытки;
	
	Сообщить("Сообщение успешно отправлено!");
КонецПроцедуры





&НаКлиентеНаСервереБезКонтекста
Процедура ПрочитатьСообщениеКлиентСервер(КлиентКомпоненты, Форма)
	
	Попытка
		КлиентКомпоненты.Connect(
		Форма.Адрес,
		Форма.Порт,
		Форма.Логин,
		Форма.Пароль,
		Форма.ВиртуальныйХост);
		
		ИмяОчереди = Форма.ИмяОчереди;
		
		Попытка
			КлиентКомпоненты.DeclareQueue(ИмяОчереди, Ложь, Ложь, Ложь, Ложь);
			
			Потребитель = КлиентКомпоненты.BasicConsume(ИмяОчереди, "", Истина, Ложь, 0);
			
			ОтветноеСообщение = "";
			Если КлиентКомпоненты.BasicConsumeMessage("", ОтветноеСообщение, 5) Тогда
				КлиентКомпоненты.BasicAck();
				Форма.ОтветноеСообщение = ОтветноеСообщение;
				ТекстСообщения = НСтр("ru='Сообщение успешно прочитано!'");
			Иначе
				Форма.ОтветноеСообщение = ОтветноеСообщение;
				ТекстСообщения = НСтр("ru='Очередь пустая!'");
			КонецЕсли;
			Сообщить(ТекстСообщения);
			
			КлиентКомпоненты.BasicCancel("");
		Исключение
			ВызватьИсключение КлиентКомпоненты.GetLastError();
		КонецПопытки;
	Исключение
		СистемнаяОшибка = ОписаниеОшибки();
		ТекстСообщения = "Ошибка чтения сообщения!%СистемнаяОшибка%";
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%СистемнаяОшибка%", СистемнаяОшибка);
		ВызватьИсключение ТекстСообщения;
	КонецПопытки;
	
КонецПроцедуры










&НаСервереБезКонтекста
Процедура ПрочитатьОчередьСообщениеКПолучениюСерверWMS(КлиентКомпоненты, Форма)
	
	Попытка
		КлиентКомпоненты.Connect(
		Форма.Адрес,
		Форма.Порт,
		Форма.Логин,
		Форма.Пароль,
		Форма.ВиртуальныйХост);
		
		ИмяОчереди = Форма.ИмяОчереди;
		
		Попытка
			КлиентКомпоненты.DeclareQueue(ИмяОчереди, Ложь, Ложь, Ложь, Ложь);
			
			Потребитель = КлиентКомпоненты.BasicConsume(ИмяОчереди, "", Истина, Ложь, 0);
			
			ОтветноеСообщение = "";
			Пока  КлиентКомпоненты.BasicConsumeMessage("", ОтветноеСообщение, 5) Цикл 
				КлиентКомпоненты.BasicAck();
				
				МенеджерЗаписи= РегистрыСведений.ОчередьСообщенийКПолучениюТС.СоздатьМенеджерЗаписи(); 
				МенеджерЗаписи.Сообщение= ОтветноеСообщение; 
				МенеджерЗаписи.ID= Новый УникальныйИдентификатор; 
				МенеджерЗаписи.Записать();
				
				
				
				//Форма.ОтветноеСообщение = ОтветноеСообщение;
			КонецЦикла; 
			
			ТекстСообщения = НСтр("ru='Сообщение успешно прочитано!'");
			Сообщить(ТекстСообщения);
			
			КлиентКомпоненты.BasicCancel("");
		Исключение
			ВызватьИсключение КлиентКомпоненты.GetLastError();
		КонецПопытки;
	Исключение
		СистемнаяОшибка = ОписаниеОшибки();
		ТекстСообщения = "Ошибка чтения сообщения!%СистемнаяОшибка%";
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%СистемнаяОшибка%", СистемнаяОшибка);
		ВызватьИсключение ТекстСообщения;
	КонецПопытки;
	
КонецПроцедуры


&НаСервере
Процедура ОтправитьСообщенияНаСервереТС()
	ОтправитьСообщенияИзОчередиСервер();
	
КонецПроцедуры



//Отправка сообщения из ТС+++++++++++++++++++++++ 

&НаКлиенте                                           
Процедура ОтправитьСообщенияТС(Команда)
	ОтправитьСообщенияНаСервереТС(); 
	Элементы.ОчередьКОтправкеТС.Обновить();  
	Элементы.ОчередьКПолучениюWMS.Обновить();
	
	
	//ЭтаФорма.ОбновитьОтображениеДанных()
КонецПроцедуры 


&НаСервере
Процедура ОтправитьСообщенияИзОчередиСервер()
	
	КлиентКомпоненты = ПолучитьКомпонентуСервер();
	ОтправитьСообщенияТССервер(КлиентКомпоненты, ЭтаФорма);
	
КонецПроцедуры 


&НаСервереБезКонтекста
Процедура ОтправитьСообщенияТССервер(КлиентКомпоненты, Форма)
	
	
	НаборЗаписей = РегистрыСведений.ОчередьСообщенийКОтправкеТС.СоздатьНаборЗаписей();  			
	НаборЗаписей.Отбор.Отправлено.Установить(Ложь);
	НаборЗаписей.Прочитать();  
	Попытка
		КлиентКомпоненты.Connect(
		Форма.Адрес,
		Форма.Порт,
		Форма.Логин,
		Форма.Пароль,
		Форма.ВиртуальныйХост); 
		
		ТочкаОбмена    = Форма.ТочкаОбменаТС;
		ИмяОчереди     = Форма.ИмяОчередиWMS;
		
		Для каждого СтрокаНабора Из НаборЗаписей Цикл 
			
			
			КлиентКомпоненты.BasicPublish(
			ТочкаОбмена,
			"#" + ИмяОчереди + "#",
			СтрокаНабора.Сообщение,
			1,
			Ложь); 
			
			
			МенеджерЗаписи =РегистрыСведений.ОчередьСообщенийКОтправкеТС.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.ID=СтрокаНабора.ID; 
			МенеджерЗаписи.Прочитать();
			МенеджерЗаписи.Отправлено =Истина;                        
			МенеджерЗаписи.Записать();
			
		КонецЦикла;
		
		
	Исключение
		СистемнаяОшибка = ОписаниеОшибки();
		ТекстСообщения = "Ошибка отправки сообщения!%СистемнаяОшибка%";
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%СистемнаяОшибка%", СистемнаяОшибка);
		ВызватьИсключение ТекстСообщения;
	КонецПопытки; 
	
	Сообщить("Сообщение успешно отправлено!"); 
	
КонецПроцедуры

//Отправки сообщений из ТС   -----------------





//Получение   сообщений ТС++++++++++++++++++     
&НаСервере
Процедура ПолучитьСообщенияТСНаСервере()
	КлиентКомпоненты = ПолучитьКомпонентуСервер();
	ПрочитатьОчередьСообщениеКПолучениюСерверТС(КлиентКомпоненты, ЭтаФорма); 
	Элементы.ОчередьКПолучениюТС.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьСообщенияТС(Команда)
	ПолучитьСообщенияТСНаСервере(); 
	Элементы.ОчередьКПолучениюТС.Обновить();
	
КонецПроцедуры


&НаСервереБезКонтекста
Процедура ПрочитатьОчередьСообщениеКПолучениюСерверТС(КлиентКомпоненты, Форма)
	
	Попытка
		КлиентКомпоненты.Connect(
		Форма.Адрес,
		Форма.Порт,
		Форма.Логин,
		Форма.Пароль,
		Форма.ВиртуальныйХост);
		
		ИмяОчереди = Форма.ИмяОчередиТС;
		
		Попытка
			КлиентКомпоненты.DeclareQueue(ИмяОчереди, Ложь, Ложь, Ложь, Ложь);
			
			Потребитель = КлиентКомпоненты.BasicConsume(ИмяОчереди, "", Истина, Ложь, 0);
			
			ОтветноеСообщение = "";
			Пока  КлиентКомпоненты.BasicConsumeMessage("", ОтветноеСообщение, 5) Цикл 
				КлиентКомпоненты.BasicAck();
				
				МенеджерЗаписи= РегистрыСведений.ОчередьСообщенийКПолучениюТС.СоздатьМенеджерЗаписи(); 
				МенеджерЗаписи.Сообщение= ОтветноеСообщение; 
				МенеджерЗаписи.ID= Новый УникальныйИдентификатор; 
				МенеджерЗаписи.Записать();
				
				
				
				//Форма.ОтветноеСообщение = ОтветноеСообщение;
			КонецЦикла; 
			
			ТекстСообщения = НСтр("ru='Сообщение успешно прочитано!'");
			Сообщить(ТекстСообщения);
			
			КлиентКомпоненты.BasicCancel("");
		Исключение
			ВызватьИсключение КлиентКомпоненты.GetLastError();
		КонецПопытки;
	Исключение
		СистемнаяОшибка = ОписаниеОшибки();
		ТекстСообщения = "Ошибка чтения сообщения!%СистемнаяОшибка%";
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%СистемнаяОшибка%", СистемнаяОшибка);
		ВызватьИсключение ТекстСообщения;
	КонецПопытки;
	
КонецПроцедуры


//Получение   сообщений ТС------------------     




//Отправка сообщений из WMS   ++++++++++++++++ 

&НаКлиенте
Процедура ОтправитьСообщенияWMS(Команда)
	ОтправитьСообщенияWMSНаСервере(); 
	Элементы.ОчередьКОтправкеWMS.Обновить();
	Элементы.ОчередьКПолучениюТС.Обновить();
КонецПроцедуры

&НаСервере
Процедура ОтправитьСообщенияWMSНаСервере()
	КлиентКомпоненты = ПолучитьКомпонентуСервер();
	ОтправитьСообщенияWMSСервер(КлиентКомпоненты, ЭтаФорма);
КонецПроцедуры



&НаСервереБезКонтекста
Процедура ОтправитьСообщенияWMSСервер(КлиентКомпоненты, Форма)
	
	
	НаборЗаписей = РегистрыСведений.ОчередьСообщенийКОтправкеWMS.СоздатьНаборЗаписей();  			
	НаборЗаписей.Отбор.Отправлено.Установить(Ложь);
	НаборЗаписей.Прочитать();  
	Попытка
		КлиентКомпоненты.Connect(
		Форма.Адрес,
		Форма.Порт,
		Форма.Логин,
		Форма.Пароль,
		Форма.ВиртуальныйХост); 
		
		ТочкаОбмена    = Форма.ТочкаОбменаWMS;
		ИмяОчереди     = Форма.ИмяОчередиТС;
		
		Для каждого СтрокаНабора Из НаборЗаписей Цикл 
			
			
			КлиентКомпоненты.BasicPublish(
			ТочкаОбмена,
			"#" + ИмяОчереди + "#",
			СтрокаНабора.Сообщение,
			1,
			Ложь); 
			
			
			МенеджерЗаписи =РегистрыСведений.ОчередьСообщенийКОтправкеWMS.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.ID=СтрокаНабора.ID; 
			МенеджерЗаписи.Прочитать();
			МенеджерЗаписи.Отправлено =Истина;                        
			МенеджерЗаписи.Записать();
			
		КонецЦикла;
		
		
	Исключение
		СистемнаяОшибка = ОписаниеОшибки();
		ТекстСообщения = "Ошибка отправки сообщения!%СистемнаяОшибка%";
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%СистемнаяОшибка%", СистемнаяОшибка);
		ВызватьИсключение ТекстСообщения;
	КонецПопытки; 
	
	Сообщить("Сообщение успешно отправлено!"); 
	
КонецПроцедуры

//Отправка сообщений из WMS   -----------------



//Получение   сообщений WMS++++++++++++++++++

&НаКлиенте
Процедура ПолучитьСообщенияWMS(Команда)
	ПолучитьСообщенияWMSНаСервере();
	Элементы.ОчередьКПолучениюWMS.Обновить();
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьСообщенияWMSНаСервере()
	КлиентКомпоненты = ПолучитьКомпонентуСервер();
	ПрочитатьОчередьСообщениеКПолучениюWMSСервер(КлиентКомпоненты, ЭтаФорма); 
КонецПроцедуры 

&НаСервереБезКонтекста
Процедура ПрочитатьОчередьСообщениеКПолучениюWMSСервер(КлиентКомпоненты, Форма)
	
	Попытка
		КлиентКомпоненты.Connect(
		Форма.Адрес,
		Форма.Порт,
		Форма.Логин,
		Форма.Пароль,
		Форма.ВиртуальныйХост);
		
		ИмяОчереди = Форма.ИмяОчередиWMS;
		
		Попытка
			КлиентКомпоненты.DeclareQueue(ИмяОчереди, Ложь, Ложь, Ложь, Ложь);
			
			Потребитель = КлиентКомпоненты.BasicConsume(ИмяОчереди, "", Истина, Ложь, 0);
			
			ОтветноеСообщение = "";
			Пока  КлиентКомпоненты.BasicConsumeMessage("", ОтветноеСообщение, 5) Цикл 
				КлиентКомпоненты.BasicAck();
				
				МенеджерЗаписи= РегистрыСведений.ОчередьСообщенийКПолучениюWMS.СоздатьМенеджерЗаписи(); 
				МенеджерЗаписи.Сообщение= ОтветноеСообщение; 
				МенеджерЗаписи.ID= Новый УникальныйИдентификатор; 
				МенеджерЗаписи.Записать();
				
				
				
				//Форма.ОтветноеСообщение = ОтветноеСообщение;
			КонецЦикла; 
			
			ТекстСообщения = НСтр("ru='Сообщение успешно прочитано!'");
			Сообщить(ТекстСообщения);
			
			КлиентКомпоненты.BasicCancel("");
		Исключение
			ВызватьИсключение КлиентКомпоненты.GetLastError();
		КонецПопытки;
	Исключение
		СистемнаяОшибка = ОписаниеОшибки();
		ТекстСообщения = "Ошибка чтения сообщения!%СистемнаяОшибка%";
		ТекстСообщения = СтрЗаменить(ТекстСообщения, "%СистемнаяОшибка%", СистемнаяОшибка);
		ВызватьИсключение ТекстСообщения;
	КонецПопытки;
	
КонецПроцедуры


//Получение   сообщений WMS------------------    


&НаКлиенте
Процедура ОбработатьСообщенияТС(Команда)
	ОбработатьСообщенияТСНаСервере(); 
	Элементы.ОчередьКПолучениюТС.Обновить();
КонецПроцедуры

&НаСервере
Процедура ОбработатьСообщенияТСНаСервере()
	
	
	
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОчередьКПолучениюТС.Обработано КАК Обработано,
	|	ОчередьКПолучениюТС.ID КАК ID,
	|	ОчередьКПолучениюТС.Сообщение КАК Сообщение
	|ИЗ
	|	РегистрСведений.ОчередьСообщенийКПолучениюТС КАК ОчередьКПолучениюТС
	|ГДЕ
	|	НЕ ОчередьКПолучениюТС.Обработано";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
		
		//ЧтениеJSON= Новый ЧтениеJSON;
		//ЧтениеJSON.УстановитьСтроку(ВыборкаДетальныеЗаписи.Сообщение); 
		//Структура=ПрочитатьJSON(ЧтениеJSON); 
		
		//	
		//	   ЧтениеJSON = Новый ЧтениеJSON;
		//ЧтениеJSON.УстановитьСтроку(ВыборкаДетальныеЗаписи.Сообщение);
		//ЗначениеОбъект = СериализаторXDTO.ПрочитатьJSON(ЧтениеJSON);
		//ЧтениеJSON.Закрыть();
		//
		//// можно записать полученный объект в базу:
		//ЗначениеОбъект.ОбменДанными.Загрузка = Истина;
		//ЗначениеОбъект.Записать();
		
		
		
		СтруктураСообщения	=РаботаСОчередями.JsonВОбъект(ВыборкаДетальныеЗаписи.Сообщение); 
		
		Документ =РаботаСОчередями.ОбработатьЗаказ(СтруктураСообщения); 
		МенеджерЗаписи =РегистрыСведений.ОчередьСообщенийКПолучениюТС.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.ID=ВыборкаДетальныеЗаписи.ID; 
		МенеджерЗаписи.Прочитать();
		МенеджерЗаписи.Обработано =Истина;                        
		МенеджерЗаписи.Записать();  
		
		Если Не Документ =Неопределено Тогда 
			
			Сообщить("Создан Документ:"+Документ);   
		КонецЕсли;
		
		
	КонецЦикла;
	
	
	
	// Вставить содержимое обработчика.
КонецПроцедуры


&НаКлиенте
Процедура ОбработатьСообщенияWMS(Команда)
	ОбработатьСообщенияWMSНаСервере();
	Элементы.ОчередьКПолучениюWMS.Обновить();
КонецПроцедуры 

&НаСервере
Процедура ОбработатьСообщенияWMSНаСервере()
	
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОчередьСообщенийКПолучениюWMS.Обработано КАК Обработано,
	|	ОчередьСообщенийКПолучениюWMS.ID КАК ID,
	|	ОчередьСообщенийКПолучениюWMS.Сообщение КАК Сообщение
	|ИЗ
	|	РегистрСведений.ОчередьСообщенийКПолучениюWMS КАК ОчередьСообщенийКПолучениюWMS
	|ГДЕ
	|	НЕ ОчередьСообщенийКПолучениюWMS.Обработано";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
		
		//ЧтениеJSON= Новый ЧтениеJSON;
		//ЧтениеJSON.УстановитьСтроку(ВыборкаДетальныеЗаписи.Сообщение); 
		//Структура=ПрочитатьJSON(ЧтениеJSON); 
		
		//	
		//	   ЧтениеJSON = Новый ЧтениеJSON;
		//ЧтениеJSON.УстановитьСтроку(ВыборкаДетальныеЗаписи.Сообщение);
		//ЗначениеОбъект = СериализаторXDTO.ПрочитатьJSON(ЧтениеJSON);
		//ЧтениеJSON.Закрыть();
		//
		//// можно записать полученный объект в базу:
		//ЗначениеОбъект.ОбменДанными.Загрузка = Истина;
		//ЗначениеОбъект.Записать();
		
		
		
		СтруктураСообщения	=РаботаСОчередями.JsonВОбъект(ВыборкаДетальныеЗаписи.Сообщение); 
		
		Документ =РаботаСОчередями.СоздатьЗадание(СтруктураСообщения);
		
		МенеджерЗаписи =РегистрыСведений.ОчередьСообщенийКПолучениюWMS.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.ID=ВыборкаДетальныеЗаписи.ID; 
		МенеджерЗаписи.Прочитать();
		МенеджерЗаписи.Обработано =Истина;                        
		МенеджерЗаписи.Записать();  
		
		Если Не Документ =Неопределено Тогда 
			Сообщить("Создан Документ:"+Документ);   
		КонецЕсли;
		
		
		
		
		
	КонецЦикла;
	
КонецПроцедуры;

#КонецОбласти
